{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape": null, "input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>D\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"class_name": "Cropping2D", "config": {"cropping": [[50, 20], [0, 0]], "trainable": true, "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "trainable": true, "name": "convolution2d_1", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 36, "W_regularizer": null, "trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 48, "W_regularizer": null, "trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "trainable": true, "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "trainable": true, "name": "convolution2d_5", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 8448, "output_dim": 100, "b_constraint": null, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 100, "output_dim": 50, "b_constraint": null, "name": "dense_2", "W_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 50, "output_dim": 10, "b_constraint": null, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "W_constraint": null, "input_dim": 10, "output_dim": 1, "b_constraint": null, "name": "dense_4", "W_regularizer": null, "b_regularizer": null, "trainable": true}}], "keras_version": "1.2.1"}