{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>E\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "trainable": true, "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"nb_col": 5, "b_constraint": null, "nb_filter": 24, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "bias": true, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "b_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "bias": true, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "bias": true, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "bias": true, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "bias": true, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 100, "activation": "linear", "trainable": true, "input_dim": 8448, "name": "dense_1", "bias": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 50, "activation": "linear", "trainable": true, "input_dim": 100, "name": "dense_2", "bias": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 10, "activation": "linear", "trainable": true, "input_dim": 50, "name": "dense_3", "bias": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "activation": "linear", "trainable": true, "input_dim": 10, "name": "dense_4", "bias": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}